app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
SELECT  "numbers".* FROM "numbers"   ORDER BY "numbers"."id" ASC LIMIT 1
---
  def index
  	@messages = Message.all
    @message = Message.new
    @number = Number.new
    @numbers = Number.all

SELECT "numbers".* FROM "numbers"
---
  def new
  	@message = Message.new(to: params[:to])
    @numbers = Number.all

INSERT INTO "messages" ("body", "from", "to") VALUES ($1, $2, $3) RETURNING "id"  [["body", "I really hope this works"], ["from", "8605564067"], ["to", "8603361346"]]
---
  def create
  	@message = Message.create(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]
---
  def destroy
  	@message = Message.destroy(params[:id])