app/controllers/numbers_controller.rb

  def create
    @number = Number.create(number_params)
---
INSERT INTO "numbers" ("contact_name", "phone_number", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["contact_name", "Jon So"], ["phone_number", "8603361346"], ["user_id", 1]]